src/PCNA/POService/sendPO.http

#POST https://pspurchaseorder100.pcna.online/psPurchaseOrder.svc
POST https://pspurchaseorder100-stg.pcna.online/psPurchaseOrder.svc
Content-Type: text/xml;charset=UTF-8
SOAPAction: "sendPO"

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.promostandards.org/WSDL/PO/1.0.0/" xmlns:shar="http://www.promostandards.org/WSDL/PO/1.0.0/SharedObjects/">
    <soapenv:Header/>
    <soapenv:Body>
        <ns:SendPORequest>
            <shar:wsVersion>1.0.0</shar:wsVersion>
            <shar:id>Moo</shar:id>
            <shar:password>r_zyel0OyUn*g.=@8TCZ>ve}+R4+q1C(w!.UIs.WMOYhmio}9LG>RFJeX+>*3dE</shar:password>
            <ns:PO>
                <ns:orderType>Configured</ns:orderType>
                <ns:orderNumber>moo-test-order-26</ns:orderNumber>
                <ns:orderDate>2025-09-04T10:45:00</ns:orderDate>
                <shar:currency>USD</shar:currency>
                <ns:OrderContactArray>
                    <shar:Contact>
                        <shar:accountName>ERIC'S COMPANY</shar:accountName>
                        <shar:accountNumber>229014</shar:accountNumber>
                        <shar:contactType>Bill</shar:contactType>
                        <shar:ContactDetails>
                            <shar:attentionTo>ERIC WINGARD</shar:attentionTo>
                            <shar:companyName>ERIC'S COMPANY</shar:companyName>
                            <shar:address1>400 HUNT VALLEY ROAD</shar:address1>
                            <shar:city>PITTSBURGH</shar:city>
                            <shar:region>PA</shar:region>
                            <shar:postalCode>15068</shar:postalCode>
                            <shar:country>US</shar:country>
                            <shar:email>ewingard@pcna.com</shar:email>
                            <shar:phone>8142441509</shar:phone>
                        </shar:ContactDetails>
                    </shar:Contact>
                </ns:OrderContactArray>
                <ns:ShipmentArray>
                    <shar:Shipment>
                        <shar:shipReferences>Ref123</shar:shipReferences>
                        <shar:blindShip>true</shar:blindShip>
                        <shar:packingListRequired>true</shar:packingListRequired>
                        <shar:ThirdPartyAccount>
                            <shar:accountName>ED'S FEDEX</shar:accountName>
                            <shar:accountNumber>123456789</shar:accountNumber>
                            <shar:ContactDetails>
                                <shar:attentionTo>ED WINGARD JR</shar:attentionTo>
                                <shar:companyName>FAST EDDIE'S BAR</shar:companyName>
                                <shar:address1>128 BRECK LANE</shar:address1>
                                <shar:city>JOHNSTOWN</shar:city>
                                <shar:region>PA</shar:region>
                                <shar:postalCode>15904</shar:postalCode>
                                <shar:country>US</shar:country>
                                <shar:email>FASTEDDIEJR3@GMAIL.COM</shar:email>
                                <shar:phone>8142667115</shar:phone>
                            </shar:ContactDetails>
                        </shar:ThirdPartyAccount>
                        <shar:FreightDetails>
                            <shar:carrier>FEDEX</shar:carrier>
                            <shar:service>GROUND</shar:service>
                        </shar:FreightDetails>
                        <shar:ShipTo>
                            <shar:shipmentId>100</shar:shipmentId>
                            <shar:ContactDetails>
                                <shar:companyName>FAST EDDIE'S BAR</shar:companyName>
                                <shar:address1>128 BRECK LANE</shar:address1>
                                <shar:city>JOHNSTOWN</shar:city>
                                <shar:region>PA</shar:region>
                                <shar:postalCode>15904</shar:postalCode>
                                <shar:country>US</shar:country>
                                <shar:email>FASTEDDIEJR3@GMAIL.COM</shar:email>
                                <shar:phone>8142667115</shar:phone>
                            </shar:ContactDetails>
                        </shar:ShipTo>
                    </shar:Shipment>
                </ns:ShipmentArray>
                <ns:LineItemArray>
                    <ns:LineItem>
                        <shar:fobId>15068</shar:fobId>
                        <ns:lineNumber>1</ns:lineNumber>
                        <ns:lineReferenceId>102529</ns:lineReferenceId>
                        <shar:description>Copper Vacuum Insulated Bottle 17oz</shar:description>
                        <ns:lineType>New</ns:lineType>
                        <shar:Quantity>
                            <shar:uom>EA</shar:uom>
                            <shar:value>100</shar:value>
                        </shar:Quantity>
                        <shar:ToleranceDetails>
                            <shar:tolerance>ExactOnly</shar:tolerance>
                        </shar:ToleranceDetails>
                        <shar:productId>1601-81</shar:productId>
                        <ns:PartArray>
                        <shar:Part>
                            <shar:partId>1601-81BK</shar:partId>
                            <shar:Quantity>
                                <shar:uom>EA</shar:uom>
                                <shar:value>100</shar:value>
                            </shar:Quantity>
                            <shar:locationLinkId>1</shar:locationLinkId>
                            <shar:ShipmentLinkArray>
                                <shar:ShipmentLink>
                                    <shar:Quantity>
                                        <shar:uom>EA</shar:uom>
                                        <shar:value>100</shar:value>
                                    </shar:Quantity>
                                    <shar:shipmentId>100</shar:shipmentId>
                                </shar:ShipmentLink>
                            </shar:ShipmentLinkArray>
                        </shar:Part>
                        </ns:PartArray>
                        <shar:Configuration>
                            <shar:LocationArray>
                                <shar:Location>
                                    <shar:locationName>Centered on tumbler opposite Hydro Flask, - Center of art 3.68" up from bottom</shar:locationName>
                                    <shar:DecorationArray>
                                        <shar:Decoration>
                                            <shar:decorationName>Digital Color Print</shar:decorationName>
                                            <shar:Artwork>
                                                <shar:ArtworkFileArray>
                                                    <shar:ArtworkFile>
                                                        <shar:artworkType>ProductionReady</shar:artworkType>
                                                        <shar:fileLocation>https://integrationdesignerimages.artifi.net/UserPhoto/ba4ad608-c4bd-4e71-b14b-81506445b434/Photos/Standard/1404320511b1a5-cad3-4bce-b9eb-51f5fbc6cb81.png</shar:fileLocation>
                                                        <shar:fileName>1404320511b1a5-cad3-4bce-b9eb-51f5fbc6cb81.png</shar:fileName>
                                                        <shar:transportMechanism>Url</shar:transportMechanism>
                                                    </shar:ArtworkFile>
                                                </shar:ArtworkFileArray>
                                                <!--Optional:-->
                                                <shar:description>NASA LOGO</shar:description>
                                                <!--Optional:-->
                                                <shar:Dimensions>
                                                    <shar:useMaxLocationDimensions>true</shar:useMaxLocationDimensions>
                                                </shar:Dimensions>
                                                <shar:Layers>
                                                    <shar:colorSystem>Pms</shar:colorSystem>
                                                    <shar:LayerOrStopArray>
                                                        <shar:LayerOrStop>
                                                                <shar:color>CMYK</shar:color>
                                                                <shar:nameOrNumber>1</shar:nameOrNumber>
                                                                <shar:description>Complete Art</shar:description>
                                                        </shar:LayerOrStop>
                                                    </shar:LayerOrStopArray>
                                                </shar:Layers>
                                            </shar:Artwork>
                                            <shar:decorationId>171</shar:decorationId>
                                        </shar:Decoration>
                                    </shar:DecorationArray>
                                    <shar:locationLinkId>1</shar:locationLinkId>
                                    <shar:locationId>17705</shar:locationId>
                                </shar:Location>
                            </shar:LocationArray>
                        </shar:Configuration>
                    </ns:LineItem>
                </ns:LineItemArray>
                <ns:termsAndConditions>terms</ns:termsAndConditions>
            </ns:PO>
        </ns:SendPORequest>
    </soapenv:Body>
</soapenv:Envelope>